[Survived] EqualityOperator
src/chat.js:272:9
         }
     }
 
-    if (failedFeatures.length > 0) {
+    if (failedFeatures.length >= 0) {
         console.error('❌ Missing required modern features:', failedFeatures);
         return false;

[Survived] StringLiteral
src/chat.js:273:23
     }
 
     if (failedFeatures.length > 0) {
-        console.error('❌ Missing required modern features:', failedFeatures);
+        console.error("", failedFeatures);
         return false;
     }

[Survived] BooleanLiteral
src/chat.js:274:16
 
     if (failedFeatures.length > 0) {
         console.error('❌ Missing required modern features:', failedFeatures);
-        return false;
+        return true;
     }
 

[Survived] BooleanLiteral
src/chat.js:278:12
     }
 
     console.log('✅ All strict modern browser features validated');
-    return true;
+    return false;
 };
 

[Survived] BlockStatement
src/chat.js:287:34
  * Check if running in secure context (HTTPS or localhost)
  * @returns {boolean} True if secure context
  */
-const checkSecureContext = () => {
-    const isSecure = window.isSecureContext || 
-                    window.location.protocol === 'https:' || 
-                    window.location.hostname === 'localhost' ||
-                    window.location.hostname === '127.0.0.1';
-    
-    if (!isSecure) {
-        addSystemMessage('⚠️ Non-secure context detected. WebRTC functionality may be limited.');
-        addSystemMessage('💡 For full functionality, use HTTPS or localhost.');
-    }
-    
-    return isSecure;
-};
+const checkSecureContext = () => {};
 
 /**

[Survived] ConditionalExpression
src/chat.js:288:22
  * @returns {boolean} True if secure context
  */
 const checkSecureContext = () => {
-    const isSecure = window.isSecureContext || 
-                    window.location.protocol === 'https:' || 
-                    window.location.hostname === 'localhost' ||
-                    window.location.hostname === '127.0.0.1';
+    const isSecure = true;
     
     if (!isSecure) {

[Survived] LogicalOperator
src/chat.js:288:22
  * @returns {boolean} True if secure context
  */
 const checkSecureContext = () => {
-    const isSecure = window.isSecureContext || 
-                    window.location.protocol === 'https:' || 
-                    window.location.hostname === 'localhost' ||
+    const isSecure = (window.isSecureContext || window.location.protocol === 'https:') && window.location.hostname === 'localhost' ||
                     window.location.hostname === '127.0.0.1';
     

[Survived] EqualityOperator
src/chat.js:289:21
  */
 const checkSecureContext = () => {
     const isSecure = window.isSecureContext || 
-                    window.location.protocol === 'https:' || 
+                    window.location.protocol !== 'https:' || 
                     window.location.hostname === 'localhost' ||
                     window.location.hostname === '127.0.0.1';

[Survived] ConditionalExpression
src/chat.js:289:21
  */
 const checkSecureContext = () => {
     const isSecure = window.isSecureContext || 
-                    window.location.protocol === 'https:' || 
+                    false || 
                     window.location.hostname === 'localhost' ||
                     window.location.hostname === '127.0.0.1';

[Survived] ConditionalExpression
src/chat.js:290:21
 const checkSecureContext = () => {
     const isSecure = window.isSecureContext || 
                     window.location.protocol === 'https:' || 
-                    window.location.hostname === 'localhost' ||
+                    false ||
                     window.location.hostname === '127.0.0.1';
     

[Survived] EqualityOperator
src/chat.js:290:21
 const checkSecureContext = () => {
     const isSecure = window.isSecureContext || 
                     window.location.protocol === 'https:' || 
-                    window.location.hostname === 'localhost' ||
+                    window.location.hostname !== 'localhost' ||
                     window.location.hostname === '127.0.0.1';
     

[Survived] EqualityOperator
src/chat.js:291:21
     const isSecure = window.isSecureContext || 
                     window.location.protocol === 'https:' || 
                     window.location.hostname === 'localhost' ||
-                    window.location.hostname === '127.0.0.1';
+                    window.location.hostname !== '127.0.0.1';
     
     if (!isSecure) {

[Survived] ConditionalExpression
src/chat.js:291:21
     const isSecure = window.isSecureContext || 
                     window.location.protocol === 'https:' || 
                     window.location.hostname === 'localhost' ||
-                    window.location.hostname === '127.0.0.1';
+                    false;
     
     if (!isSecure) {

[Survived] BooleanLiteral
src/chat.js:293:9
                     window.location.hostname === 'localhost' ||
                     window.location.hostname === '127.0.0.1';
     
-    if (!isSecure) {
+    if (isSecure) {
         addSystemMessage('⚠️ Non-secure context detected. WebRTC functionality may be limited.');
         addSystemMessage('💡 For full functionality, use HTTPS or localhost.');

[Survived] ConditionalExpression
src/chat.js:293:9
                     window.location.hostname === 'localhost' ||
                     window.location.hostname === '127.0.0.1';
     
-    if (!isSecure) {
+    if (true) {
         addSystemMessage('⚠️ Non-secure context detected. WebRTC functionality may be limited.');
         addSystemMessage('💡 For full functionality, use HTTPS or localhost.');

[Survived] BlockStatement
src/chat.js:305:34
  * Check WebRTC support in the browser
  * @returns {boolean} True if WebRTC is supported
  */
-const checkWebRTCSupport = () => {
-    const hasWebRTC = !!(window.RTCPeerConnection && window.RTCDataChannel);
-    
-    if (!hasWebRTC) {
-        addSystemMessage('❌ WebRTC not supported in this browser.');
-        addSystemMessage('💡 Please use a modern browser with WebRTC support.');
-    }
-    
-    return hasWebRTC;
-};
+const checkWebRTCSupport = () => {};
 
 // ===== CONNECTION STATUS MANAGEMENT =====

[Survived] BooleanLiteral
src/chat.js:306:23
  * @returns {boolean} True if WebRTC is supported
  */
 const checkWebRTCSupport = () => {
-    const hasWebRTC = !!(window.RTCPeerConnection && window.RTCDataChannel);
+    const hasWebRTC = !(window.RTCPeerConnection && window.RTCDataChannel);
     
     if (!hasWebRTC) {

[Survived] ConditionalExpression
src/chat.js:306:26
  * @returns {boolean} True if WebRTC is supported
  */
 const checkWebRTCSupport = () => {
-    const hasWebRTC = !!(window.RTCPeerConnection && window.RTCDataChannel);
+    const hasWebRTC = !!(true);
     
     if (!hasWebRTC) {

[Survived] BlockStatement
src/chat.js:308:21
 const checkWebRTCSupport = () => {
     const hasWebRTC = !!(window.RTCPeerConnection && window.RTCDataChannel);
     
-    if (!hasWebRTC) {
-        addSystemMessage('❌ WebRTC not supported in this browser.');
-        addSystemMessage('💡 Please use a modern browser with WebRTC support.');
-    }
+    if (!hasWebRTC) {}
     
     return hasWebRTC;

[Survived] ConditionalExpression
src/chat.js:308:9
 const checkWebRTCSupport = () => {
     const hasWebRTC = !!(window.RTCPeerConnection && window.RTCDataChannel);
     
-    if (!hasWebRTC) {
+    if (false) {
         addSystemMessage('❌ WebRTC not supported in this browser.');
         addSystemMessage('💡 Please use a modern browser with WebRTC support.');

[Survived] StringLiteral
src/chat.js:309:26
     const hasWebRTC = !!(window.RTCPeerConnection && window.RTCDataChannel);
     
     if (!hasWebRTC) {
-        addSystemMessage('❌ WebRTC not supported in this browser.');
+        addSystemMessage("");
         addSystemMessage('💡 Please use a modern browser with WebRTC support.');
     }

[Killed] BlockStatement
src/chat.js:323:53
  * @param {string} status - Status type: 'disconnected', 'connecting', 'connected', 'error'
  * @param {string} message - Status message to display
  */
-const updateConnectionStatus = (status, message) => {
-    const statusIndicator = getElementById('status-indicator');
-    const statusText = getElementById('status-text');
-    const retryBtn = getElementById('retry-btn');
-    
-    // Update status text if available
-    if (statusText) {
-        statusText.textContent = message;
-    }
-    
-    // Update status indicator if available
-    if (statusIndicator) {
-        // Remove all status classes
-        statusIndicator.className = 'status-indicator';
-        
-        // Add appropriate status class
-        statusIndicator.classList.add(`status-${status}`);
-    }
-    
-    // Show/hide retry button based on status
-    if (retryBtn) {
-        retryBtn.style.display = status === 'error' ? 'inline-block' : 'none';
-    }
-};
+const updateConnectionStatus = (status, message) => {};
 
 // ===== PEER CONNECTION MANAGEMENT =====
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Survived] StringLiteral
src/chat.js:324:44
  * @param {string} message - Status message to display
  */
 const updateConnectionStatus = (status, message) => {
-    const statusIndicator = getElementById('status-indicator');
+    const statusIndicator = getElementById("");
     const statusText = getElementById('status-text');
     const retryBtn = getElementById('retry-btn');

[Survived] StringLiteral
src/chat.js:326:37
 const updateConnectionStatus = (status, message) => {
     const statusIndicator = getElementById('status-indicator');
     const statusText = getElementById('status-text');
-    const retryBtn = getElementById('retry-btn');
+    const retryBtn = getElementById("");
     
     // Update status text if available

[Killed] ConditionalExpression
src/chat.js:329:9
     const retryBtn = getElementById('retry-btn');
     
     // Update status text if available
-    if (statusText) {
+    if (false) {
         statusText.textContent = message;
     }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/chat.js:329:21
     const retryBtn = getElementById('retry-btn');
     
     // Update status text if available
-    if (statusText) {
-        statusText.textContent = message;
-    }
+    if (statusText) {}
     
     // Update status indicator if available
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] ConditionalExpression
src/chat.js:334:9
     }
     
     // Update status indicator if available
-    if (statusIndicator) {
+    if (true) {
         // Remove all status classes
         statusIndicator.className = 'status-indicator';
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Survived] BlockStatement
src/chat.js:334:26
     }
     
     // Update status indicator if available
-    if (statusIndicator) {
-        // Remove all status classes
-        statusIndicator.className = 'status-indicator';
-        
-        // Add appropriate status class
-        statusIndicator.classList.add(`status-${status}`);
-    }
+    if (statusIndicator) {}
     
     // Show/hide retry button based on status

[Killed] ConditionalExpression
src/chat.js:343:9
     }
     
     // Show/hide retry button based on status
-    if (retryBtn) {
+    if (true) {
         retryBtn.style.display = status === 'error' ? 'inline-block' : 'none';
     }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Survived] ConditionalExpression
src/chat.js:343:9
     }
     
     // Show/hide retry button based on status
-    if (retryBtn) {
+    if (false) {
         retryBtn.style.display = status === 'error' ? 'inline-block' : 'none';
     }

[Survived] ConditionalExpression
src/chat.js:344:34
     
     // Show/hide retry button based on status
     if (retryBtn) {
-        retryBtn.style.display = status === 'error' ? 'inline-block' : 'none';
+        retryBtn.style.display = false ? 'inline-block' : 'none';
     }
 };

[Survived] EqualityOperator
src/chat.js:344:34
     
     // Show/hide retry button based on status
     if (retryBtn) {
-        retryBtn.style.display = status === 'error' ? 'inline-block' : 'none';
+        retryBtn.style.display = status !== 'error' ? 'inline-block' : 'none';
     }
 };

[Survived] BooleanLiteral
src/chat.js:356:9
  */
 const initializePeer = async () => {
     // Check secure context and WebRTC support before initialization
-    if (!checkSecureContext()) {
+    if (checkSecureContext()) {
         // Continue with limited functionality warning
     }

[Survived] ConditionalExpression
src/chat.js:356:9
  */
 const initializePeer = async () => {
     // Check secure context and WebRTC support before initialization
-    if (!checkSecureContext()) {
+    if (true) {
         // Continue with limited functionality warning
     }

[Survived] ConditionalExpression
src/chat.js:360:9
         // Continue with limited functionality warning
     }
 
-    if (!checkWebRTCSupport()) {
+    if (true) {
         addSystemMessage('❌ Cannot initialize peer connection - WebRTC not supported.');
         return;

[Survived] BooleanLiteral
src/chat.js:360:9
         // Continue with limited functionality warning
     }
 
-    if (!checkWebRTCSupport()) {
+    if (checkWebRTCSupport()) {
         addSystemMessage('❌ Cannot initialize peer connection - WebRTC not supported.');
         return;

[Survived] ObjectLiteral
src/chat.js:368:21
     try {
         // Enhanced modern configuration using basic ICE servers
         const peerConfig = {
-            config: {
-                iceServers: [
-                    { urls: CONFIG.STUN_SERVER }
-                ],
-                // Safari 14+ modern WebRTC optimizations
-                iceCandidatePoolSize: 10,
-                bundlePolicy: 'max-bundle',
-                rtcpMuxPolicy: 'require',
-                iceTransportPolicy: 'all'
-            },
+            config: {},
 
             // Enhanced debugging with modern conditional logic

[Survived] ObjectLiteral
src/chat.js:370:21
         const peerConfig = {
             config: {
                 iceServers: [
-                    { urls: CONFIG.STUN_SERVER }
+                    {}
                 ],
                 // Safari 14+ modern WebRTC optimizations

[Survived] ConditionalExpression
src/chat.js:380:20
             },
 
             // Enhanced debugging with modern conditional logic
-            debug: window.location.hostname === 'localhost' ? 2 : 0,
+            debug: false ? 2 : 0,
 
             // Modern PeerJS configuration

[Survived] EqualityOperator
src/chat.js:380:20
             },
 
             // Enhanced debugging with modern conditional logic
-            debug: window.location.hostname === 'localhost' ? 2 : 0,
+            debug: window.location.hostname !== 'localhost' ? 2 : 0,
 
             // Modern PeerJS configuration

[Survived] BooleanLiteral
src/chat.js:384:23
 
             // Modern PeerJS configuration
             serialization: 'json', // Use JSON serialization for better performance
-            reliable: true, // Enable reliable data channels
+            reliable: false, // Enable reliable data channels
         };
 

[Survived] BlockStatement
src/chat.js:396:33
         addSystemMessage('🔧 Using default STUN server configuration');
 
         // Modern event handling with arrow functions and optional chaining
-        peer.on('open', (id) => {
-            updateMyId(id);
-            myId = id;
-            addSystemMessage('✅ Your ID is ready; share it with your peer.');
-
-            // Modern conditional logic with nullish coalescing
-            const protocol = window.location.protocol;
-            const isSecure = protocol === 'https:';
-
-            if (isSecure) {
-                addSystemMessage('🔒 Running in secure HTTPS context - full WebRTC functionality available.');
-            } else {
-                addSystemMessage('⚠️ Running in HTTP context - some features may be limited.');
-                addSystemMessage('💡 For production deployment, use HTTPS (e.g., GitHub Pages).');
-            }
-
-            updateConnectionStatus('disconnected', 'Ready to connect');
-        });
+        peer.on('open', (id) => {});
 
         peer.on('connection', (conn) => {

[Survived] StringLiteral
src/chat.js:396:17
         addSystemMessage('🔧 Using default STUN server configuration');
 
         // Modern event handling with arrow functions and optional chaining
-        peer.on('open', (id) => {
+        peer.on("", (id) => {
             updateMyId(id);
             myId = id;

[Survived] ConditionalExpression
src/chat.js:403:30
 
             // Modern conditional logic with nullish coalescing
             const protocol = window.location.protocol;
-            const isSecure = protocol === 'https:';
+            const isSecure = true;
 
             if (isSecure) {

[Survived] EqualityOperator
src/chat.js:403:30
 
             // Modern conditional logic with nullish coalescing
             const protocol = window.location.protocol;
-            const isSecure = protocol === 'https:';
+            const isSecure = protocol !== 'https:';
 
             if (isSecure) {

[Survived] ConditionalExpression
src/chat.js:405:17
             const protocol = window.location.protocol;
             const isSecure = protocol === 'https:';
 
-            if (isSecure) {
+            if (true) {
                 addSystemMessage('🔒 Running in secure HTTPS context - full WebRTC functionality available.');
             } else {

[Survived] ConditionalExpression
src/chat.js:405:17
             const protocol = window.location.protocol;
             const isSecure = protocol === 'https:';
 
-            if (isSecure) {
+            if (false) {
                 addSystemMessage('🔒 Running in secure HTTPS context - full WebRTC functionality available.');
             } else {

[Survived] StringLiteral
src/chat.js:406:34
             const isSecure = protocol === 'https:';
 
             if (isSecure) {
-                addSystemMessage('🔒 Running in secure HTTPS context - full WebRTC functionality available.');
+                addSystemMessage("";
             } else {
                 addSystemMessage('⚠️ Running in HTTP context - some features may be limited.');

[Survived] BlockStatement
src/chat.js:407:20
 
             if (isSecure) {
                 addSystemMessage('🔒 Running in secure HTTPS context - full WebRTC functionality available.');
-            } else {
-                addSystemMessage('⚠️ Running in HTTP context - some features may be limited.');
-                addSystemMessage('💡 For production deployment, use HTTPS (e.g., GitHub Pages).');
-            }
+            } else {}
 
             updateConnectionStatus('disconnected', 'Ready to connect');

[Survived] StringLiteral
src/chat.js:412:36
                 addSystemMessage('💡 For production deployment, use HTTPS (e.g., GitHub Pages).');
             }
 
-            updateConnectionStatus('disconnected', 'Ready to connect');
+            updateConnectionStatus("", 'Ready to connect');
         });
 

[Survived] BlockStatement
src/chat.js:415:41
             updateConnectionStatus('disconnected', 'Ready to connect');
         });
 
-        peer.on('connection', (conn) => {
-            addSystemMessage(`📞 Incoming connection from: ${conn.peer}`);
-            handleIncomingConnection(conn);
-        });
+        peer.on('connection', (conn) => {});
 
         peer.on('error', (error) => {

[Survived] BlockStatement
src/chat.js:420:37
             handleIncomingConnection(conn);
         });
 
-        peer.on('error', (error) => {
-            console.error('PeerJS Error:', error);
-            addSystemMessage(`❌ Peer error: ${error.message || error.type || 'Unknown error'}`);
-            updateConnectionStatus('error', `Error: ${error.type || 'Unknown'}`);
-
-            // Modern error recovery with exponential backoff
-            setTimeout(() => initializePeer(), 5000);
-        });
+        peer.on('error', (error) => {});
 
         peer.on('disconnected', () => {

[Survived] LogicalOperator
src/chat.js:422:47
 
         peer.on('error', (error) => {
             console.error('PeerJS Error:', error);
-            addSystemMessage(`❌ Peer error: ${error.message || error.type || 'Unknown error'}`);
+            addSystemMessage(`❌ Peer error: ${(error.message || error.type) && 'Unknown error'}`);
             updateConnectionStatus('error', `Error: ${error.type || 'Unknown'}`);
 

[Survived] ConditionalExpression
src/chat.js:422:47
 
         peer.on('error', (error) => {
             console.error('PeerJS Error:', error);
-            addSystemMessage(`❌ Peer error: ${error.message || error.type || 'Unknown error'}`);
+            addSystemMessage(`❌ Peer error: ${true}`);
             updateConnectionStatus('error', `Error: ${error.type || 'Unknown'}`);
 

[Survived] LogicalOperator
src/chat.js:423:55
         peer.on('error', (error) => {
             console.error('PeerJS Error:', error);
             addSystemMessage(`❌ Peer error: ${error.message || error.type || 'Unknown error'}`);
-            updateConnectionStatus('error', `Error: ${error.type || 'Unknown'}`);
+            updateConnectionStatus('error', `Error: ${error.type && 'Unknown'}`);
 
             // Modern error recovery with exponential backoff

[Survived] ConditionalExpression
src/chat.js:423:55
         peer.on('error', (error) => {
             console.error('PeerJS Error:', error);
             addSystemMessage(`❌ Peer error: ${error.message || error.type || 'Unknown error'}`);
-            updateConnectionStatus('error', `Error: ${error.type || 'Unknown'}`);
+            updateConnectionStatus('error', `Error: ${true}`);
 
             // Modern error recovery with exponential backoff

[Survived] ArrowFunction
src/chat.js:426:24
             updateConnectionStatus('error', `Error: ${error.type || 'Unknown'}`);
 
             // Modern error recovery with exponential backoff
-            setTimeout(() => initializePeer(), 5000);
+            setTimeout(() => undefined, 5000);
         });
 

[Survived] BlockStatement
src/chat.js:429:39
             setTimeout(() => initializePeer(), 5000);
         });
 
-        peer.on('disconnected', () => {
-            addSystemMessage('🔌 Peer disconnected from signaling server');
-            updateConnectionStatus('error', 'Disconnected from server');
-            
-            // Attempt to reconnect
-            if (!peer.destroyed) {
-                peer.reconnect();
-                addSystemMessage('🔄 Attempting to reconnect...');
-            }
-        });
+        peer.on('disconnected', () => {});
 
         peer.on('close', () => {

[Survived] StringLiteral
src/chat.js:431:36
 
         peer.on('disconnected', () => {
             addSystemMessage('🔌 Peer disconnected from signaling server');
-            updateConnectionStatus('error', 'Disconnected from server');
+            updateConnectionStatus("", 'Disconnected from server');
             
             // Attempt to reconnect

[Survived] BlockStatement
src/chat.js:434:34
             updateConnectionStatus('error', 'Disconnected from server');
             
             // Attempt to reconnect
-            if (!peer.destroyed) {
-                peer.reconnect();
-                addSystemMessage('🔄 Attempting to reconnect...');
-            }
+            if (!peer.destroyed) {}
         });
 

[Survived] BooleanLiteral
src/chat.js:434:17
             updateConnectionStatus('error', 'Disconnected from server');
             
             // Attempt to reconnect
-            if (!peer.destroyed) {
+            if (peer.destroyed) {
                 peer.reconnect();
                 addSystemMessage('🔄 Attempting to reconnect...');

[Survived] StringLiteral
src/chat.js:436:34
             // Attempt to reconnect
             if (!peer.destroyed) {
                 peer.reconnect();
-                addSystemMessage('🔄 Attempting to reconnect...');
+                addSystemMessage("";
             }
         });

[Survived] BlockStatement
src/chat.js:440:32
             }
         });
 
-        peer.on('close', () => {
-            addSystemMessage('🔌 Peer connection closed');
-            updateConnectionStatus('disconnected', 'Connection closed');
-        });
+        peer.on('close', () => {});
 
     } catch (error) {

[Survived] StringLiteral
src/chat.js:440:17
             }
         });
 
-        peer.on('close', () => {
+        peer.on("", () => {
             addSystemMessage('🔌 Peer connection closed');
             updateConnectionStatus('disconnected', 'Connection closed');

[Survived] BlockStatement
src/chat.js:445:21
             updateConnectionStatus('disconnected', 'Connection closed');
         });
 
-    } catch (error) {
-        console.error('Failed to initialize peer:', error);
-        addSystemMessage(`❌ Failed to initialize peer: ${error.message}`);
-        updateConnectionStatus('error', 'Initialization failed');
-    }
+    } catch (error) {}
 };
 

[Survived] StringLiteral
src/chat.js:448:41
     } catch (error) {
         console.error('Failed to initialize peer:', error);
         addSystemMessage(`❌ Failed to initialize peer: ${error.message}`);
-        updateConnectionStatus('error', 'Initialization failed');
+        updateConnectionStatus('error', "");
     }
 };

[Survived] BlockStatement
src/chat.js:456:44
  * Handles incoming peer connections
  * @param {DataConnection} conn - The incoming connection
  */
-const handleIncomingConnection = (conn) => {
-    connection = conn;
-    
-    conn.on('open', () => {
-        addSystemMessage(`✅ Connected to peer: ${conn.peer}`);
-        updateConnectionStatus('connected', `Connected to ${conn.peer}`);
-        enableSendButton();
-    });
-
-    conn.on('data', (data) => {
-        handleReceivedMessage(data);
-    });
-
-    conn.on('close', () => {
-        handleConnectionClose();
-    });
-
-    conn.on('error', (error) => {
-        console.error('Connection error:', error);
-        addSystemMessage(`❌ Connection error: ${error.message || 'Unknown error'}`);
-        updateConnectionStatus('error', 'Connection error');
-    });
-};
+const handleIncomingConnection = (conn) => {};
 
 /**

[Survived] BlockStatement
src/chat.js:459:27
 const handleIncomingConnection = (conn) => {
     connection = conn;
     
-    conn.on('open', () => {
-        addSystemMessage(`✅ Connected to peer: ${conn.peer}`);
-        updateConnectionStatus('connected', `Connected to ${conn.peer}`);
-        enableSendButton();
-    });
+    conn.on('open', () => {});
 
     conn.on('data', (data) => {

[Survived] BlockStatement
src/chat.js:465:31
         enableSendButton();
     });
 
-    conn.on('data', (data) => {
-        handleReceivedMessage(data);
-    });
+    conn.on('data', (data) => {});
 
     conn.on('close', () => {

[Survived] BlockStatement
src/chat.js:469:28
         handleReceivedMessage(data);
     });
 
-    conn.on('close', () => {
-        handleConnectionClose();
-    });
+    conn.on('close', () => {});
 
     conn.on('error', (error) => {

[Survived] BlockStatement
src/chat.js:473:33
         handleConnectionClose();
     });
 
-    conn.on('error', (error) => {
-        console.error('Connection error:', error);
-        addSystemMessage(`❌ Connection error: ${error.message || 'Unknown error'}`);
-        updateConnectionStatus('error', 'Connection error');
-    });
+    conn.on('error', (error) => {});
 };
 

[Survived] ConditionalExpression
src/chat.js:475:49
 
     conn.on('error', (error) => {
         console.error('Connection error:', error);
-        addSystemMessage(`❌ Connection error: ${error.message || 'Unknown error'}`);
+        addSystemMessage(`❌ Connection error: ${false}`);
         updateConnectionStatus('error', 'Connection error');
     });

[Survived] LogicalOperator
src/chat.js:475:49
 
     conn.on('error', (error) => {
         console.error('Connection error:', error);
-        addSystemMessage(`❌ Connection error: ${error.message || 'Unknown error'}`);
+        addSystemMessage(`❌ Connection error: ${error.message && 'Unknown error'}`);
         updateConnectionStatus('error', 'Connection error');
     });

[Survived] BooleanLiteral
src/chat.js:485:9
  * @param {string} peerId - The peer ID to connect to
  */
 const connectToPeer = (peerId) => {
-    if (!peer) {
+    if (peer) {
         addSystemMessage('❌ Peer not initialized. Please wait and try again.');
         return;

[Survived] ConditionalExpression
src/chat.js:485:9
  * @param {string} peerId - The peer ID to connect to
  */
 const connectToPeer = (peerId) => {
-    if (!peer) {
+    if (false) {
         addSystemMessage('❌ Peer not initialized. Please wait and try again.');
         return;

[Survived] StringLiteral
src/chat.js:486:26
  */
 const connectToPeer = (peerId) => {
     if (!peer) {
-        addSystemMessage('❌ Peer not initialized. Please wait and try again.');
+        addSystemMessage("");
         return;
     }
