[Killed] BlockStatement
src/utils.js:14:52
  * @param {Date} date - The date to format
  * @returns {string} Formatted timestamp string
  */
-export function formatTimestamp(date = new Date()) {
-    return date.toLocaleTimeString('en-US', {
-        hour12: false,
-        hour: '2-digit',
-        minute: '2-digit',
-        second: '2-digit'
-    });
-}
+export function formatTimestamp(date = new Date()) {}
 
 // ===== PEER ID VALIDATION UTILITIES =====
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BooleanLiteral
src/utils.js:16:17
  */
 export function formatTimestamp(date = new Date()) {
     return date.toLocaleTimeString('en-US', {
-        hour12: false,
+        hour12: true,
         hour: '2-digit',
         minute: '2-digit',
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] StringLiteral
src/utils.js:17:15
 export function formatTimestamp(date = new Date()) {
     return date.toLocaleTimeString('en-US', {
         hour12: false,
-        hour: '2-digit',
+        hour: "",
         minute: '2-digit',
         second: '2-digit'
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] StringLiteral
src/utils.js:19:17
         hour12: false,
         hour: '2-digit',
         minute: '2-digit',
-        second: '2-digit'
+        second: ""
     });
 }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:30:40
  * @param {string} peerId - The peer ID to validate
  * @returns {boolean} True if valid, false if empty or whitespace-only
  */
-export function validatePeerId(peerId) {
-    return Boolean(peerId?.trim());
-}
+export function validatePeerId(peerId) {}
 
 // ===== MESSAGE CREATION UTILITIES =====
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] OptionalChaining
src/utils.js:31:20
  * @returns {boolean} True if valid, false if empty or whitespace-only
  */
 export function validatePeerId(peerId) {
-    return Boolean(peerId?.trim());
+    return Boolean(peerId.trim());
 }
 
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] MethodExpression
src/utils.js:31:20
  * @returns {boolean} True if valid, false if empty or whitespace-only
  */
 export function validatePeerId(peerId) {
-    return Boolean(peerId?.trim());
+    return Boolean(peerId);
 }
 
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:41:43
  * @param {string} text - The message text
  * @returns {string} Formatted system message
  */
-export function createSystemMessage(text) {
-    return `System: ${text}`;
-}
+export function createSystemMessage(text) {}
 
 /**
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:51:52
  * @param {string} sender - The sender type ('me', 'peer', 'system')
  * @returns {string} Formatted message
  */
-export function createMessage(text, sender = 'me') {
-    const prefixes = new Map([
-        ['me', 'Me:'],
-        ['peer', 'Peer:'],
-        ['peer-relay', 'Peer (Relay):'],
-        ['system', 'System:']
-    ]);
-    
-    const prefix = prefixes.get(sender) ?? 'Unknown:';
-    return `${prefix} ${text}`;
-}
+export function createMessage(text, sender = 'me') {}
 
 // ===== DOM HELPER FUNCTIONS =====
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] ArrayDeclaration
src/utils.js:53:9
  */
 export function createMessage(text, sender = 'me') {
     const prefixes = new Map([
-        ['me', 'Me:'],
+        [],
         ['peer', 'Peer:'],
         ['peer-relay', 'Peer (Relay):'],
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] StringLiteral
src/utils.js:54:18
 export function createMessage(text, sender = 'me') {
     const prefixes = new Map([
         ['me', 'Me:'],
-        ['peer', 'Peer:'],
+        ['peer', ""],
         ['peer-relay', 'Peer (Relay):'],
         ['system', 'System:']
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] StringLiteral
src/utils.js:55:24
     const prefixes = new Map([
         ['me', 'Me:'],
         ['peer', 'Peer:'],
-        ['peer-relay', 'Peer (Relay):'],
+        ['peer-relay', ""],
         ['system', 'System:']
     ]);
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] StringLiteral
src/utils.js:56:10
         ['me', 'Me:'],
         ['peer', 'Peer:'],
         ['peer-relay', 'Peer (Relay):'],
-        ['system', 'System:']
+        ["", 'System:']
     ]);
     
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] ArrayDeclaration
src/utils.js:56:9
         ['me', 'Me:'],
         ['peer', 'Peer:'],
         ['peer-relay', 'Peer (Relay):'],
-        ['system', 'System:']
+        []
     ]);
     
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] LogicalOperator
src/utils.js:59:20
         ['system', 'System:']
     ]);
     
-    const prefix = prefixes.get(sender) ?? 'Unknown:';
+    const prefix = prefixes.get(sender) && 'Unknown:';
     return `${prefix} ${text}`;
 }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:70:36
  * @param {string} id - The element ID to find
  * @returns {HTMLElement|null} The element or null if not found
  */
-export function getElementById(id) {
-    try {
-        return document.getElementById(id);
-    } catch (error) {
-        console.error(`Error finding element with ID "${id}":`, error);
-        return null;
-    }
-}
+export function getElementById(id) {}
 
 /**
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:71:9
  * @returns {HTMLElement|null} The element or null if not found
  */
 export function getElementById(id) {
-    try {
-        return document.getElementById(id);
-    } catch (error) {
+    try {} catch (error) {
         console.error(`Error finding element with ID "${id}":`, error);
         return null;
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:73:21
 export function getElementById(id) {
     try {
         return document.getElementById(id);
-    } catch (error) {
-        console.error(`Error finding element with ID "${id}":`, error);
-        return null;
-    }
+    } catch (error) {}
 }
 
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:86:77
  * @param {Function} handler - The event handler function
  * @param {Object} options - Event listener options
  */
-export function addEventListenerSafe(element, event, handler, options = {}) {
-    if (!element || typeof handler !== 'function') {
-        console.error('Invalid element or handler for addEventListener');
-        return;
-    }
-    
-    try {
-        element.addEventListener(event, handler, options);
-    } catch (error) {
-        console.error(`Error adding event listener for "${event}":`, error);
-    }
-}
+export function addEventListenerSafe(element, event, handler, options = {}) {}
 
 /**
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BooleanLiteral
src/utils.js:87:9
  * @param {Object} options - Event listener options
  */
 export function addEventListenerSafe(element, event, handler, options = {}) {
-    if (!element || typeof handler !== 'function') {
+    if (element || typeof handler !== 'function') {
         console.error('Invalid element or handler for addEventListener');
         return;
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] EqualityOperator
src/utils.js:87:21
  * @param {Object} options - Event listener options
  */
 export function addEventListenerSafe(element, event, handler, options = {}) {
-    if (!element || typeof handler !== 'function') {
+    if (!element || typeof handler === 'function') {
         console.error('Invalid element or handler for addEventListener');
         return;
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:92:9
         return;
     }
     
-    try {
-        element.addEventListener(event, handler, options);
-    } catch (error) {
+    try {} catch (error) {
         console.error(`Error adding event listener for "${event}":`, error);
     }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Survived] BlockStatement
src/utils.js:94:21
     
     try {
         element.addEventListener(event, handler, options);
-    } catch (error) {
-        console.error(`Error adding event listener for "${event}":`, error);
-    }
+    } catch (error) {}
 }
 

[Killed] BlockStatement
src/utils.js:103:32
  * Updates the displayed peer ID and stores it globally
  * @param {string} id - The peer ID to display and store
  */
-export function updateMyId(id) {
-    const myIdElement = getElementById('my-id');
-    if (myIdElement) {
-        try {
-            myIdElement.textContent = id;
-        } catch (error) {
-            console.error('Error updating peer ID display:', error);
-        }
-    }
-    
-    // Store globally for compatibility
-    if (typeof window !== 'undefined') {
-        try {
-            window.myId = id;
-        } catch (error) {
-            console.error('Error storing peer ID globally:', error);
-        }
-    }
-}
+export function updateMyId(id) {}
 
 /**
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] ConditionalExpression
src/utils.js:105:9
  */
 export function updateMyId(id) {
     const myIdElement = getElementById('my-id');
-    if (myIdElement) {
+    if (false) {
         try {
             myIdElement.textContent = id;
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:105:22
  */
 export function updateMyId(id) {
     const myIdElement = getElementById('my-id');
-    if (myIdElement) {
-        try {
-            myIdElement.textContent = id;
-        } catch (error) {
-            console.error('Error updating peer ID display:', error);
-        }
-    }
+    if (myIdElement) {}
     
     // Store globally for compatibility
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:106:13
 export function updateMyId(id) {
     const myIdElement = getElementById('my-id');
     if (myIdElement) {
-        try {
-            myIdElement.textContent = id;
-        } catch (error) {
+        try {} catch (error) {
             console.error('Error updating peer ID display:', error);
         }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Survived] BlockStatement
src/utils.js:108:25
     if (myIdElement) {
         try {
             myIdElement.textContent = id;
-        } catch (error) {
-            console.error('Error updating peer ID display:', error);
-        }
+        } catch (error) {}
     }
     

[Killed] EqualityOperator
src/utils.js:114:9
     }
     
     // Store globally for compatibility
-    if (typeof window !== 'undefined') {
+    if (typeof window === 'undefined') {
         try {
             window.myId = id;
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:114:40
     }
     
     // Store globally for compatibility
-    if (typeof window !== 'undefined') {
-        try {
-            window.myId = id;
-        } catch (error) {
-            console.error('Error storing peer ID globally:', error);
-        }
-    }
+    if (typeof window !== 'undefined') {}
 }
 
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:115:13
     
     // Store globally for compatibility
     if (typeof window !== 'undefined') {
-        try {
-            window.myId = id;
-        } catch (error) {
+        try {} catch (error) {
             console.error('Error storing peer ID globally:', error);
         }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Survived] BlockStatement
src/utils.js:117:25
     if (typeof window !== 'undefined') {
         try {
             window.myId = id;
-        } catch (error) {
-            console.error('Error storing peer ID globally:', error);
-        }
+        } catch (error) {}
     }
 }

[Killed] BlockStatement
src/utils.js:128:51
  * @param {string} message - The message text to add
  * @param {string} sender - The sender type ('me', 'peer', 'system')
  */
-export function addMessageToChat(message, sender) {
-    const chatLog = getElementById('chat-log');
-    if (!chatLog) {
-        console.error('Chat log element not found');
-        return;
-    }
-
-    try {
-        const formattedMessage = createMessage(message, sender);
-        chatLog.value += formattedMessage + '\n';
-        chatLog.scrollTop = chatLog.scrollHeight;
-    } catch (error) {
-        console.error('Error adding message to chat:', error);
-    }
-}
+export function addMessageToChat(message, sender) {}
 
 /**
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] StringLiteral
src/utils.js:129:36
  * @param {string} sender - The sender type ('me', 'peer', 'system')
  */
 export function addMessageToChat(message, sender) {
-    const chatLog = getElementById('chat-log');
+    const chatLog = getElementById("");
     if (!chatLog) {
         console.error('Chat log element not found');
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] ConditionalExpression
src/utils.js:130:9
  */
 export function addMessageToChat(message, sender) {
     const chatLog = getElementById('chat-log');
-    if (!chatLog) {
+    if (true) {
         console.error('Chat log element not found');
         return;
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BooleanLiteral
src/utils.js:130:9
  */
 export function addMessageToChat(message, sender) {
     const chatLog = getElementById('chat-log');
-    if (!chatLog) {
+    if (chatLog) {
         console.error('Chat log element not found');
         return;
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:135:9
         return;
     }
 
-    try {
-        const formattedMessage = createMessage(message, sender);
-        chatLog.value += formattedMessage + '\n';
-        chatLog.scrollTop = chatLog.scrollHeight;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error adding message to chat:', error);
     }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] AssignmentOperator
src/utils.js:137:9
 
     try {
         const formattedMessage = createMessage(message, sender);
-        chatLog.value += formattedMessage + '\n';
+        chatLog.value -= formattedMessage + '\n';
         chatLog.scrollTop = chatLog.scrollHeight;
     } catch (error) {
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] StringLiteral
src/utils.js:137:45
 
     try {
         const formattedMessage = createMessage(message, sender);
-        chatLog.value += formattedMessage + '\n';
+        chatLog.value += formattedMessage + "";
         chatLog.scrollTop = chatLog.scrollHeight;
     } catch (error) {
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Survived] BlockStatement
src/utils.js:139:21
         const formattedMessage = createMessage(message, sender);
         chatLog.value += formattedMessage + '\n';
         chatLog.scrollTop = chatLog.scrollHeight;
-    } catch (error) {
-        console.error('Error adding message to chat:', error);
-    }
+    } catch (error) {}
 }
 

[Killed] BlockStatement
src/utils.js:148:43
  * Adds a system message to the chat log
  * @param {string} message - The system message to add
  */
-export function addSystemMessage(message) {
-    addMessageToChat(message, 'system');
-}
+export function addSystemMessage(message) {}
 
 // ===== TEST FRAMEWORK SETUP AND UTILITIES =====
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:168:50
  * @param {string} description - Description of the test suite
  * @param {Function} testSuite - Function containing the tests
  */
-export function describe(description, testSuite) {
-    console.log(`\n=== ${description} ===`);
-    testSuite();
-}
+export function describe(description, testSuite) {}
 
 /**
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Survived] BlockStatement
src/utils.js:178:49
  * @param {string} description - Description of the test
  * @param {Function} testFunction - Function containing the test logic
  */
-export function test(description, testFunction) {
-    try {
-        testFunction();
-        testResults.push({ description, status: 'PASS', error: null });
-        console.log(`✓ ${description}`);
-    } catch (error) {
-        testResults.push({ description, status: 'FAIL', error: error.message });
-        console.log(`✗ ${description}: ${error.message}`);
-    }
-}
+export function test(description, testFunction) {}
 
 /**

[Survived] BlockStatement
src/utils.js:179:9
  * @param {Function} testFunction - Function containing the test logic
  */
 export function test(description, testFunction) {
-    try {
-        testFunction();
-        testResults.push({ description, status: 'PASS', error: null });
-        console.log(`✓ ${description}`);
-    } catch (error) {
+    try {} catch (error) {
         testResults.push({ description, status: 'FAIL', error: error.message });
         console.log(`✗ ${description}: ${error.message}`);

[Survived] BlockStatement
src/utils.js:183:21
         testFunction();
         testResults.push({ description, status: 'PASS', error: null });
         console.log(`✓ ${description}`);
-    } catch (error) {
-        testResults.push({ description, status: 'FAIL', error: error.message });
-        console.log(`✗ ${description}: ${error.message}`);
-    }
+    } catch (error) {}
 }
 

[Survived] StringLiteral
src/utils.js:184:49
         testResults.push({ description, status: 'PASS', error: null });
         console.log(`✓ ${description}`);
     } catch (error) {
-        testResults.push({ description, status: 'FAIL', error: error.message });
+        testResults.push({ description, status: "", error: error.message });
         console.log(`✗ ${description}: ${error.message}`);
     }

[Killed] BlockStatement
src/utils.js:195:70
  * @param {Function} testFunction - Function containing the test logic
  * @param {number} timeout - Timeout in milliseconds
  */
-export function asyncTest(description, testFunction, timeout = 5000) {
-    totalAsyncTests++;
-    setTimeout(() => {
-        try {
-            testFunction();
-            testResults.push({ description, status: 'PASS', error: null });
-            console.log(`✓ ${description}`);
-        } catch (error) {
-            testResults.push({ description, status: 'FAIL', error: error.message });
-            console.log(`✗ ${description}: ${error.message}`);
-        }
-        asyncTestsCompleted++;
-        if (asyncTestsCompleted === totalAsyncTests) {
-            displayTestResults();
-        }
-    }, timeout);
-}
+export function asyncTest(description, testFunction, timeout = 5000) {}
 
 /**
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Survived] UpdateOperator
src/utils.js:196:5
  * @param {number} timeout - Timeout in milliseconds
  */
 export function asyncTest(description, testFunction, timeout = 5000) {
-    totalAsyncTests++;
+    totalAsyncTests--;
     setTimeout(() => {
         try {

[Killed] BlockStatement
src/utils.js:197:22
  */
 export function asyncTest(description, testFunction, timeout = 5000) {
     totalAsyncTests++;
-    setTimeout(() => {
-        try {
-            testFunction();
-            testResults.push({ description, status: 'PASS', error: null });
-            console.log(`✓ ${description}`);
-        } catch (error) {
-            testResults.push({ description, status: 'FAIL', error: error.message });
-            console.log(`✗ ${description}: ${error.message}`);
-        }
-        asyncTestsCompleted++;
-        if (asyncTestsCompleted === totalAsyncTests) {
-            displayTestResults();
-        }
-    }, timeout);
+    setTimeout(() => {}, timeout);
 }
 
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:198:13
 export function asyncTest(description, testFunction, timeout = 5000) {
     totalAsyncTests++;
     setTimeout(() => {
-        try {
-            testFunction();
-            testResults.push({ description, status: 'PASS', error: null });
-            console.log(`✓ ${description}`);
-        } catch (error) {
+        try {} catch (error) {
             testResults.push({ description, status: 'FAIL', error: error.message });
             console.log(`✗ ${description}: ${error.message}`);
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Survived] StringLiteral
src/utils.js:204:25
             console.log(`✓ ${description}`);
         } catch (error) {
             testResults.push({ description, status: 'FAIL', error: error.message });
-            console.log(`✗ ${description}: ${error.message}`);
+            console.log(``);
         }
         asyncTestsCompleted++;

[Survived] UpdateOperator
src/utils.js:206:9
             testResults.push({ description, status: 'FAIL', error: error.message });
             console.log(`✗ ${description}: ${error.message}`);
         }
-        asyncTestsCompleted++;
+        asyncTestsCompleted--;
         if (asyncTestsCompleted === totalAsyncTests) {
             displayTestResults();

[Survived] EqualityOperator
src/utils.js:207:13
             console.log(`✗ ${description}: ${error.message}`);
         }
         asyncTestsCompleted++;
-        if (asyncTestsCompleted === totalAsyncTests) {
+        if (asyncTestsCompleted !== totalAsyncTests) {
             displayTestResults();
         }

[Survived] ConditionalExpression
src/utils.js:207:13
             console.log(`✗ ${description}: ${error.message}`);
         }
         asyncTestsCompleted++;
-        if (asyncTestsCompleted === totalAsyncTests) {
+        if (true) {
             displayTestResults();
         }

[Survived] BlockStatement
src/utils.js:220:29
  */
 export function expect(actual) {
     return {
-        toBe: (expected) => {
-            if (actual !== expected) {
-                throw new Error(`Expected ${expected}, but got ${actual}`);
-            }
-        },
+        toBe: (expected) => {},
         toBeNull: () => {
             if (actual !== null) {

[Killed] EqualityOperator
src/utils.js:221:17
 export function expect(actual) {
     return {
         toBe: (expected) => {
-            if (actual !== expected) {
+            if (actual === expected) {
                 throw new Error(`Expected ${expected}, but got ${actual}`);
             }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] ConditionalExpression
src/utils.js:221:17
 export function expect(actual) {
     return {
         toBe: (expected) => {
-            if (actual !== expected) {
+            if (true) {
                 throw new Error(`Expected ${expected}, but got ${actual}`);
             }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:225:25
                 throw new Error(`Expected ${expected}, but got ${actual}`);
             }
         },
-        toBeNull: () => {
-            if (actual !== null) {
-                throw new Error(`Expected null, but got ${actual}`);
-            }
-        },
+        toBeNull: () => {},
         not: {
             toBeNull: () => {
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?
