[Killed] ConditionalExpression
src/utils.js:226:17
             }
         },
         toBeNull: () => {
-            if (actual !== null) {
+            if (true) {
                 throw new Error(`Expected null, but got ${actual}`);
             }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:226:34
             }
         },
         toBeNull: () => {
-            if (actual !== null) {
-                throw new Error(`Expected null, but got ${actual}`);
-            }
+            if (actual !== null) {}
         },
         not: {
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] ObjectLiteral
src/utils.js:230:14
                 throw new Error(`Expected null, but got ${actual}`);
             }
         },
-        not: {
-            toBeNull: () => {
-                if (actual === null) {
-                    throw new Error(`Expected not null, but got null`);
-                }
-            }
-        },
+        not: {},
         toBeTruthy: () => {
             if (!actual) {
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:231:29
             }
         },
         not: {
-            toBeNull: () => {
-                if (actual === null) {
-                    throw new Error(`Expected not null, but got null`);
-                }
-            }
+            toBeNull: () => {}
         },
         toBeTruthy: () => {
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] ConditionalExpression
src/utils.js:232:21
         },
         not: {
             toBeNull: () => {
-                if (actual === null) {
+                if (true) {
                     throw new Error(`Expected not null, but got null`);
                 }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:232:38
         },
         not: {
             toBeNull: () => {
-                if (actual === null) {
-                    throw new Error(`Expected not null, but got null`);
-                }
+                if (actual === null) {}
             }
         },
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:237:27
                 }
             }
         },
-        toBeTruthy: () => {
-            if (!actual) {
-                throw new Error(`Expected truthy value, but got ${actual}`);
-            }
-        },
+        toBeTruthy: () => {},
         toContain: (expected) => {
             if (!actual.includes(expected)) {
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] ConditionalExpression
src/utils.js:238:17
             }
         },
         toBeTruthy: () => {
-            if (!actual) {
+            if (true) {
                 throw new Error(`Expected truthy value, but got ${actual}`);
             }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BooleanLiteral
src/utils.js:238:17
             }
         },
         toBeTruthy: () => {
-            if (!actual) {
+            if (actual) {
                 throw new Error(`Expected truthy value, but got ${actual}`);
             }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:242:34
                 throw new Error(`Expected truthy value, but got ${actual}`);
             }
         },
-        toContain: (expected) => {
-            if (!actual.includes(expected)) {
-                throw new Error(`Expected "${actual}" to contain "${expected}"`);
-            }
-        },
+        toContain: (expected) => {},
         toBeGreaterThan: (expected) => {
             if (actual <= expected) {
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BooleanLiteral
src/utils.js:243:17
             }
         },
         toContain: (expected) => {
-            if (!actual.includes(expected)) {
+            if (actual.includes(expected)) {
                 throw new Error(`Expected "${actual}" to contain "${expected}"`);
             }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] ConditionalExpression
src/utils.js:243:17
             }
         },
         toContain: (expected) => {
-            if (!actual.includes(expected)) {
+            if (true) {
                 throw new Error(`Expected "${actual}" to contain "${expected}"`);
             }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] StringLiteral
src/utils.js:244:33
         },
         toContain: (expected) => {
             if (!actual.includes(expected)) {
-                throw new Error(`Expected "${actual}" to contain "${expected}"`);
+                throw new Error(``);
             }
         },
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:247:40
                 throw new Error(`Expected "${actual}" to contain "${expected}"`);
             }
         },
-        toBeGreaterThan: (expected) => {
-            if (actual <= expected) {
-                throw new Error(`Expected ${actual} to be greater than ${expected}`);
-            }
-        },
+        toBeGreaterThan: (expected) => {},
         toBeGreaterThanOrEqual: (expected) => {
             if (actual < expected) {
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] ConditionalExpression
src/utils.js:248:17
             }
         },
         toBeGreaterThan: (expected) => {
-            if (actual <= expected) {
+            if (true) {
                 throw new Error(`Expected ${actual} to be greater than ${expected}`);
             }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] ConditionalExpression
src/utils.js:248:17
             }
         },
         toBeGreaterThan: (expected) => {
-            if (actual <= expected) {
+            if (false) {
                 throw new Error(`Expected ${actual} to be greater than ${expected}`);
             }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:252:47
                 throw new Error(`Expected ${actual} to be greater than ${expected}`);
             }
         },
-        toBeGreaterThanOrEqual: (expected) => {
-            if (actual < expected) {
-                throw new Error(`Expected ${actual} to be greater than or equal to ${expected}`);
-            }
-        },
+        toBeGreaterThanOrEqual: (expected) => {},
         toBeLessThan: (expected) => {
             if (actual >= expected) {
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] EqualityOperator
src/utils.js:253:17
             }
         },
         toBeGreaterThanOrEqual: (expected) => {
-            if (actual < expected) {
+            if (actual >= expected) {
                 throw new Error(`Expected ${actual} to be greater than or equal to ${expected}`);
             }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] ConditionalExpression
src/utils.js:253:17
             }
         },
         toBeGreaterThanOrEqual: (expected) => {
-            if (actual < expected) {
+            if (true) {
                 throw new Error(`Expected ${actual} to be greater than or equal to ${expected}`);
             }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:257:37
                 throw new Error(`Expected ${actual} to be greater than or equal to ${expected}`);
             }
         },
-        toBeLessThan: (expected) => {
-            if (actual >= expected) {
-                throw new Error(`Expected ${actual} to be less than ${expected}`);
-            }
-        }
+        toBeLessThan: (expected) => {}
     };
 }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] BlockStatement
src/utils.js:258:37
             }
         },
         toBeLessThan: (expected) => {
-            if (actual >= expected) {
-                throw new Error(`Expected ${actual} to be less than ${expected}`);
-            }
+            if (actual >= expected) {}
         }
     };
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Killed] ConditionalExpression
src/utils.js:258:17
             }
         },
         toBeLessThan: (expected) => {
-            if (actual >= expected) {
+            if (true) {
                 throw new Error(`Expected ${actual} to be less than ${expected}`);
             }
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Survived] BlockStatement
src/utils.js:268:38
 /**
  * Displays test results in the DOM
  */
-export function displayTestResults() {
-    const testOutput = getElementById('test-output');
-    if (!testOutput) return;
-
-    const passedTests = testResults.filter(test => test.status === 'PASS');
-    const failedTests = testResults.filter(test => test.status === 'FAIL');
-
-    let html = `
-        <h4>Test Summary</h4>
-        <p>Total: ${testResults.length} | 
-           <span class="test-pass">Passed: ${passedTests.length}</span> | 
-           <span class="test-fail">Failed: ${failedTests.length}</span></p>
-    `;
-
-    if (failedTests.length > 0) {
-        html += '<h4>Failed Tests:</h4>';
-        failedTests.forEach(test => {
-            html += `<div class="test-fail">✗ ${test.description}: ${test.error}</div>`;
-        });
-    }
-
-    testOutput.innerHTML = html;
-}
+export function displayTestResults() {}
 
 /**

[Survived] ConditionalExpression
src/utils.js:270:9
  */
 export function displayTestResults() {
     const testOutput = getElementById('test-output');
-    if (!testOutput) return;
+    if (true) return;
 
     const passedTests = testResults.filter(test => test.status === 'PASS');

[Survived] BooleanLiteral
src/utils.js:270:9
  */
 export function displayTestResults() {
     const testOutput = getElementById('test-output');
-    if (!testOutput) return;
+    if (testOutput) return;
 
     const passedTests = testResults.filter(test => test.status === 'PASS');

[Survived] MethodExpression
src/utils.js:272:25
     const testOutput = getElementById('test-output');
     if (!testOutput) return;
 
-    const passedTests = testResults.filter(test => test.status === 'PASS');
+    const passedTests = testResults;
     const failedTests = testResults.filter(test => test.status === 'FAIL');
 

[Survived] EqualityOperator
src/utils.js:272:52
     const testOutput = getElementById('test-output');
     if (!testOutput) return;
 
-    const passedTests = testResults.filter(test => test.status === 'PASS');
+    const passedTests = testResults.filter(test => test.status !== 'PASS');
     const failedTests = testResults.filter(test => test.status === 'FAIL');
 

[Survived] MethodExpression
src/utils.js:273:25
     if (!testOutput) return;
 
     const passedTests = testResults.filter(test => test.status === 'PASS');
-    const failedTests = testResults.filter(test => test.status === 'FAIL');
+    const failedTests = testResults;
 
     let html = `

[Survived] EqualityOperator
src/utils.js:273:52
     if (!testOutput) return;
 
     const passedTests = testResults.filter(test => test.status === 'PASS');
-    const failedTests = testResults.filter(test => test.status === 'FAIL');
+    const failedTests = testResults.filter(test => test.status !== 'FAIL');
 
     let html = `

[Survived] StringLiteral
src/utils.js:275:16
     const passedTests = testResults.filter(test => test.status === 'PASS');
     const failedTests = testResults.filter(test => test.status === 'FAIL');
 
-    let html = `
-        <h4>Test Summary</h4>
-        <p>Total: ${testResults.length} | 
-           <span class="test-pass">Passed: ${passedTests.length}</span> | 
-           <span class="test-fail">Failed: ${failedTests.length}</span></p>
-    `;
+    let html = ``;
 
     if (failedTests.length > 0) {

[Survived] EqualityOperator
src/utils.js:282:9
            <span class="test-fail">Failed: ${failedTests.length}</span></p>
     `;
 
-    if (failedTests.length > 0) {
+    if (failedTests.length >= 0) {
         html += '<h4>Failed Tests:</h4>';
         failedTests.forEach(test => {

[Survived] ConditionalExpression
src/utils.js:282:9
            <span class="test-fail">Failed: ${failedTests.length}</span></p>
     `;
 
-    if (failedTests.length > 0) {
+    if (false) {
         html += '<h4>Failed Tests:</h4>';
         failedTests.forEach(test => {

[Survived] StringLiteral
src/utils.js:283:17
     `;
 
     if (failedTests.length > 0) {
-        html += '<h4>Failed Tests:</h4>';
+        html += "";
         failedTests.forEach(test => {
             html += `<div class="test-fail">✗ ${test.description}: ${test.error}</div>`;

[Survived] BlockStatement
src/utils.js:284:37
 
     if (failedTests.length > 0) {
         html += '<h4>Failed Tests:</h4>';
-        failedTests.forEach(test => {
-            html += `<div class="test-fail">✗ ${test.description}: ${test.error}</div>`;
-        });
+        failedTests.forEach(test => {});
     }
 

[Survived] StringLiteral
src/utils.js:285:21
     if (failedTests.length > 0) {
         html += '<h4>Failed Tests:</h4>';
         failedTests.forEach(test => {
-            html += `<div class="test-fail">✗ ${test.description}: ${test.error}</div>`;
+            html += ``;
         });
     }

[Survived] BlockStatement
src/utils.js:295:38
 /**
  * Sets up the test framework and initializes test results
  */
-export function setupTestFramework() {
-    testResults = [];
-    asyncTestsCompleted = 0;
-    totalAsyncTests = 0;
-    
-    // Initialize test output element if it exists
-    const testOutput = getElementById('test-output');
-    if (testOutput) {
-        testOutput.innerHTML = '<p>Initializing tests...</p>';
-    }
-    
-    console.log('Test framework initialized');
-}
+export function setupTestFramework() {}
 
 /**

[Timeout] ArrayDeclaration
src/utils.js:296:19
  * Sets up the test framework and initializes test results
  */
 export function setupTestFramework() {
-    testResults = [];
+    testResults = ["Stryker was here"];
     asyncTestsCompleted = 0;
     totalAsyncTests = 0;

[Survived] ConditionalExpression
src/utils.js:302:9
     
     // Initialize test output element if it exists
     const testOutput = getElementById('test-output');
-    if (testOutput) {
+    if (true) {
         testOutput.innerHTML = '<p>Initializing tests...</p>';
     }

[Survived] ConditionalExpression
src/utils.js:302:9
     
     // Initialize test output element if it exists
     const testOutput = getElementById('test-output');
-    if (testOutput) {
+    if (false) {
         testOutput.innerHTML = '<p>Initializing tests...</p>';
     }

[Survived] StringLiteral
src/utils.js:303:32
     // Initialize test output element if it exists
     const testOutput = getElementById('test-output');
     if (testOutput) {
-        testOutput.innerHTML = '<p>Initializing tests...</p>';
+        testOutput.innerHTML = "";
     }
     

[Survived] BlockStatement
src/utils.js:312:28
 /**
  * Runs all tests and displays results
  */
-export function runTests() {
-    console.log('Running test suite...');
-    setupTestFramework();
-    
-    // If there are no async tests, display results immediately
-    if (totalAsyncTests === 0) {
-        displayTestResults();
-    }
-}
+export function runTests() {}
 
 // ===== UTILITY EXPORTS FOR COMPATIBILITY =====

[Survived] BlockStatement
src/utils.js:317:32
     setupTestFramework();
     
     // If there are no async tests, display results immediately
-    if (totalAsyncTests === 0) {
-        displayTestResults();
-    }
+    if (totalAsyncTests === 0) {}
 }
 

[Survived] EqualityOperator
src/utils.js:317:9
     setupTestFramework();
     
     // If there are no async tests, display results immediately
-    if (totalAsyncTests === 0) {
+    if (totalAsyncTests !== 0) {
         displayTestResults();
     }

[Killed] BlockStatement
src/utils.js:328:34
  * Gets the current test results
  * @returns {Array} Array of test result objects
  */
-export function getTestResults() {
-    return [...testResults];
-}
+export function getTestResults() {}
 
 /**
killedBy: All tests
statusReason: bun test v1.2.19 (aad3abea)


smoke_test.js:

🧪 Testing module imports...

❌ Module loading test failed: Unable to connect. Is the computer able to access the url?

[Survived] ArrayDeclaration
src/utils.js:329:12
  * @returns {Array} Array of test result objects
  */
 export function getTestResults() {
-    return [...testResults];
+    return [];
 }
 

[Survived] BlockStatement
src/utils.js:335:36
 /**
  * Clears all test results
  */
-export function clearTestResults() {
-    testResults = [];
-    asyncTestsCompleted = 0;
-    totalAsyncTests = 0;
-}
+export function clearTestResults() {}
